
class CommonClassLists{

    func getCareerDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"キャリア形成入門":[6,2],
		"キャリアデザインとジェンダーⅠ":[6,2],
		"キャリアデザインとジェンダーⅡ":[6,2],
		"海外キャリア形成入門":[6,2],
		"海外職場体験":[6,2],
		"生命保険実務":[6,2],
		"損害保険実務":[6,2],
		"地域企業(自治体)お題解決プログラム":[6,2],
		"日本企業インターシップⅠ":[6,2],
		"日本企業インターシップⅡ":[6,2],
		"キャリア関係特別講義Ⅰ(有償型職場実践プログラム)":[6,2],
		"キャリア関係特別講義Ⅱ(中期インターシップ)":[6,2],
		"キャリア関係特別講義Ⅴ (人生100年時代におけるキャリア開発のための働き方入門)":[6,2],
		"キャリア関係特別講義Ⅲ(石垣ウェルネス地方創生インターシップ)":[6,2],
		"キャリ関係特別講義Ⅳ(カトープレジャーグループKPG HOTEL & RESORT)":[6,2],
	]
	return lists
    }

    func getGeneralExerciseDictionaly() -> Dictionary<String,Array<Int>>{

	let lists = [
    		"工学基礎演習":[12,2]，
    		"キャリアデザイン入門":[12,1]，
    		"プロジェクトデザイン":[12,2]，
    		"キャリアデザイン":[12,2]
	]
	return lists
    }

    func getHumanitiesDictionary() -> Dictionary<String,Array<Int>>{

	let 　lists = [
		"人間と哲学の知":[0,2],
		"心の科学":[0,2],
		"人間関係論":[0,2],
		"人間観と教育":[0,2],
		"日本古典文学の世界":[0,2],
		"文学の楽しみ":[0,2],
		"中国古典文学の世界":[0,2],
		"西洋の歴史と文化":[0,2],
		"考古学入門":[0,2],
		"コーラスアンサンブルの楽しみ":[0,2],
		"楽しく学ぶギター弾き語りⅠ":[0,2],
		"ステージスタッフ総額活動":[0,2],
		"美術って何？":[0,2],
		"陶芸の世界":[0,2],
		"比較思想文化論":[0,2],
		"日本語研究入門":[0,2],
		"オーケストラの楽しみⅠ":[0,2],
		"人間と哲学の和":[0,2],
		"思考の論理入門":[0,2],
		"人間と宗教":[0,2],
		"西洋思想と日本・中国の思想":[0,2],
		"近代日本の社会と表現":[0,2],
		"小説の社会学":[0,2],
		"ことばの生態":[0,2],
		"ことばの構造と意味":[0,2],
		"日本語のはたらき":[0,2],
		"20世紀の中国文学":[0,2],
		"考古学入門":[0,2],
		"宗教と世界":[0,2],
		"美術の世界":[0,2],
		"楽しく学ぶギター弾き語りⅡ":[0,2],
		"美術と社会":[0,2],
		"オーケストラの楽しみⅡ":[0,2],
	]
	return lists
    }

    func getRelatedInformationDictionary(){

	let lists = [
		"情報科学演習":[9,2],
		"日本語表現法入門":[9,2],
	]
	return lists
    }

    func getJapaneseDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"Basic Japanese I":[10,5],
		"Basic Japanese Ⅱ":[10,3],
		"日本語A":[10,8],
		"日本語B1":[10,2],
		"文法A":[10,1]
		"文法B1":[10,1],
		"文法B2S":[10,2],
		"文法B2F":[10,2],
		"文法C1S":[10,2],
		"文法C1F":[10,2],
		"文法C2S":[10,2],
		"文法C2F":[10,2],
		"読解A":[10,1],
		"読解B1":[10,1],
		"読解B2S":[10,2],
		"読解B2F":[10,2],
		"読解C1S":[10,2],
		"読解C1F":[10,2],
		"読解C2S":[10,2],
		"読解C2F":[10,2],
		"聴解B2S":[10,2],
		"聴解B2F":[10,2],
		"聴解C1S":[10,2],
		"聴解C1F":[10,2],
		"聴解C2S":[10,2],
		"聴解C2F":[10,2],
		"作文B1":[10,1],
		"アカデミック日本語C1S":[10,2],
		"アカデミック日本語C1F":[10,2],
		"アカデミック日本語C2S":[10,2],
		"アカデミック日本語C2F":[10,2],
		"会話A":[10,1],
		"会話B1":[10,1],
		"会話B2S":[10,2],
		"会話B2F":[10,2],
		"会話C1S":[10,2],
		"会話C1F":[10,2],
		"会話C2S":[10,2],
		"会話C2F":[10,2],
		"漢字A":[10,1],
		"漢字B1":[10,1],
		"漢字B2S":[10,1],
		"漢字B2F":[10,1],
		"口頭表現C1S":[10,2],
		"口頭表現C1F":[10,2],
		"口頭表現C2S":[10,2],
		"口頭表現C2F":[10,2],
		"ビジネス日本語入門":[10,2],
		"ビジネス日本語Ⅰ":[10,2],
		"ビジネス日本語Ⅱ":[10,2],
		"沖繩の文化Ⅰ":[10,2],
		"沖繩の文化Ⅱ":[10,2],
		"沖繩の歴史Ⅰ":[10,2],
		"沖繩の歴史Ⅱ":[10,2],
		"Okinawan Culture I":[10,2],
		"Okinawan Culture Ⅱ":[10,2],
		"Okinawan History I":[10,2],
		"Okinawan History Ⅱ":[10,2],
		"日本の文化I":[10,2],
		"日本の文化Ⅱ":[10,2],
		"日本の歴史I":[10,2],
		"日本の歴史Ⅱ":[10,2],
		"Japanese Culture I":[10,2],
		"Japanese Culture Ⅱ":[10,2],
		"Japanese History I":[10,2],
		"Japanese History Ⅱ":[10,2],

	]
	return lists
    }

    func getSportsDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"健康・スポーツ科学":[4,2],
		"健康・スポーツ科学演習(バドミントン)":[4,2],
		"健康・スポーツ科学演習(テニス)":[4,2],
		"健康・スポーツ科学演習(卓球)":[4,2],
		"健康・スポーツ科学演習(サッカー)":[4,2],
		"健康・スポーツ科学演習(フットサル)":[4,2],
		"健康・スポーツ科学演習(バスケットボール)":[4,2],
		"健康・スポーツ科学演習(空手)":[4,2],
		"健康・スポーツ科学演習(ニュースポーツ)":[4,2],
		"健康・スポーツ科学演習(アウトドアレクリェーション)":[4,2],
		"健康・スポーツ科学演習(フォーク・ソーシャルダンス)":[4,2],
		"健康・スポーツ科学演習(マラソン)":[4,2],
		"健康・スポーツ科学演習(インドア・スポーツ)":[4,2],
	]
	return lists
    }

    func getPreparatoryDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"線型代数学Ⅰ":[8,2],
		"線型代数学演習":[8,2],
		"統計学":[8,2],
		"統計学Ⅰ":[8,2],
		"地球科学Ⅰ":[8,2],
		"物理学実験":[8,2],
		"化学Ⅰ":[8,2],
		"化学入門Ⅰ":[8,2],
		"化学実験":[8,2],
		"生物学Ⅰ":[8,2],
		"生物学Ⅱ":[8,2],
		"生物学実験":[8,2],
	]
	return lists
    }

    func getRelationalComputerScienceDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"基礎数学１":[17,1],
		"基礎数学２":[17,1],
		"情報処理技術概要":[17,2],
		"インターンシップ１":[17,1],
		"インターンシップ２":[17,1],
		"インターンシップ３":[17,2],
		"技術英語１":[17,2],
		"技術英語２":[17,2],
		"技術英語３":[17,2],
		"産業社会学言論１":[17,2],
		"産業社会学言論２":[17,2],
		"地域創生論":[17,2],
		"国際協力論":[17,2],
		"情報技術演習１":[17,2],
		"情報技術演習２":[17,2],
		"情報技術演習３":[17,1],
		"情報技術演習４":[17,1],
		"知能情報特別講義１":[17,2],
		"知能情報特別講義２":[17,2],
		"知能情報特別講義３":[17,1],
		"知能情報特別講義４":[17,1],
		"国際インターンシップ１":[17,1],
		"国際インターンシップ２":[17,2],
		"Frontiers of Engineering":[17,2],
		"知的財産権":[17,2],
		"品質管理":[17,2],
		"経営工学概論":[17,2],
		"ICT実践英語１":[17,2],
		"ICT実践英語２":[17,2],
		"情報化教育法A":[17,2],
		"情報化教育法B":[17,2],
		"職業指導(工学)":[17,2],
		"教職総合演習(情報)":[17,2],
		"教職実践演習(高)":[17,2],
	]
	return lists
    }

    func getRyukyuDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"平和論":[7,2],
		"核の科学":[7,2],
		"女性と社会":[7,2],
		"沖縄の基地と戦跡I":[7,2],
		"近代沖縄の社会と実現":[7,2],
		"琉球の文学":[7,2],
		"地域の科学":[7,2],
		"琉球の自然":[7,2],
		"琉球の自然保護":[7,2],
		"沖縄のサンゴ礁":[7,2],
		"琉球弧の自然誌":[7,2],
		"琉球の地理":[7,2],
		"現代の国際関係":[7,2],
		"琉球アジア研究入門":[7,2],
		"移民論":[7,2],
		"沖縄の政治と社会":[7,2],
		"うちなーぐちあしび":[7,2],
		"沖縄の学力と教育":[7,2],
		"琉球語入門Ⅰ":[7,2],
		"琉球語入門Ⅱ":[7,2],
		"沖縄の染めと織り":[7,2],
		"沖縄の歴史入門":[7,2],
		"琉球学入門":[7,2],
		"琉球の自然と人":[7,2],
		"現代沖縄地域論":[7,2],
		"現代沖縄の地域復興":[7,2],
		"地域システム計画論":[7,2],
		"地域環境と生活空間":[7,2],
		"地域プロジェクト実践":[7,2],
		"地域フィールドワーク入門":[7,2],
		"島嶼地域科学入門":[7,2],
		"沖縄の航空事業と地域振興":[7,2],
		"グローカル実践演習I":[7,2],
		"グローカル実践演習Ⅱ":[7,2],
	]
	return lists
    }

    func getNatureDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"大気の科学":[2,2],
		"地球の科学":[2,2],
		"海洋の科学":[2,2],
		"宇宙の科学":[2,2],
		"科学の光と影":[2,2],
		"統計と社会":[2,2],
		"数理の構造":[2,2],
		"数の文化":[2,2],
		"時間と空間":[2,2],
		"人間と物理学":[2,2],
		"生活の化学":[2,2],
		"分子の世界":[2,2],
		"生物の生活":[2,2],
		"生命の科学":[2,2],
		"パースの世界":[2,2],
		"沖縄の風景":[2,2],
		"社会統計学基礎":[2,2],
		"都市環境と計画":[2,2],
		"ランドスケープ論":[2,2],
		"環境デザイン論":[2,2],
		"地球環境と科学技術":[2,2],
		"自然環境と土木工学":[2,2],
		"生物資源利用とサイエンス":[2,2],
		"食料・農村・環境概論":[2,2],
		"ヒトの健康科学":[2,2],
		"人の健康科学":[2,2],
	]
	return lists
    }

    func getSocietyDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"法と社会":[3,2],
		"憲法概論":[3,2],
		"現代政治の課題":[3,2],
		"日本の政治":[3,2],
		"マスコミと社会":[3,2],
		"戦争と平和の諸問題":[3,2],
		"地域と生活":[3,2],
		"現代社会のしくみ":[3,2],
		"人類文化の比較":[3,2],
		"経済の歴史":[3,2],
		"現代経済のしくみ":[3,2],
		"現代経営のしくみ":[3,2],
		"情報メディアと創造性":[3,2],
		"大学教育論":[3,2],
		"教育政策史":[3,2],
		"ベンチャー企業入門":[3,2],
		"ベンチャー起業実践":[3,2],
		"社会系特別講義Ⅰ(社会調査入門)":[3,2],
		"ジェンダー学とインターセクショナリティ":[3,2],
	]
	return lists
    }

   func getSyntheticDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"脳の発達と人間":[5,2],
		"アメリカの文化と社会":[5,2],
		"住まいの科学":[5,2],
		"情報科学概論":[5,2],
		"動物実験の基礎":[5,2],
		"人口と食糧":[5,2],
		"災害と安全":[5,2],
		"環境と文学":[5,2],
		"グローバル実践演習Ⅰ":[5,2],
		"グローバル実践演習Ⅱ":[5,2],
		"情報セキュリティ概論":[5,2],
		"環境影響評価概論":[5,2],
		"論理総合討論":[5,2],
		"総合環境論":[5,2],
		"適応の心理":[5,2],
		"日本語学概説Ⅱ":[5,2],
		"日本語教育学概説Ⅱ":[5,2],
		"日本語教育各論Ⅱ":[5,2],
		"日本語教材研究Ⅱ":[5,2],
		"日本語教授法Ⅱ":[5,2],
		"日本語教育実習":[5,2],
		"日本語教育演習Ⅱ":[5,2],
		"日本語教育演習Ⅳ":[5,2],
	]
	return lists
    }

   func getSpecializedBasicSubjectsDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
    		"微分積分学ST Ⅰ":[19,2],
    		"微分積分学ST Ⅱ":[19,2],
    		"物理学Ⅰ":[19,2],
    		"物理学Ⅱ":[19,2],
    		"微分積分学入門 Ⅰ":[19,2],
    		"微分積分学入門 Ⅱ":[19,2],
    		"物理学入門Ⅰ":[19,2],
    		"物理学入門Ⅱ":[19,2],
	]
	return lists
    }

   func getOtherLanguageDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
   		"大学英語" : [1, 4],
   		"英語講読演習 中級" : [1, 2],
   		"英語講読演習 上級" : [1, 2],
 　		"英会話演習 中級" : [1, 2],
   		"英会話演習 上級" : [1, 2],
 　		"英作文演習 中級" : [1, 2],
   		"英作文演習 上級" : [1, 2],
 　		"英語プレゼンテーション演習 中級" : [1, 2],
   		"英語プレゼンテーション演習 上級" : [1, 2],
   		"TOEIC演習" : [1, 2],
   		"TOEFL演習" : [1, 2],
   		"英検準1級演習" : [1, 2],
   		"特定英語課題演習Ⅰ" : [1, 2],
   		"特定英語課題演習Ⅱ" : [1, 2],
   		"ドイツ語入門Ⅰ" : [1, 2],
   		"ドイツ語入門Ⅱ" : [1, 2],
   		"ドイツ語入門Ⅲ" : [1, 2],
   		"ドイツ語入門Ⅳ" : [1, 2],
   		"ドイツ語会話入門Ⅰ" : [1, 2],
   		"ドイツ語会話入門Ⅱ" : [1, 2], 
   		"インテンシブドイツ語Ⅰ" : [1, 4],
   		"インテンシブドイツ語Ⅱ" : [1, 4],
   		"インテンシブドイツ語Ⅲ" : [1, 2],
   		"インテンシブドイツ語Ⅳ" : [1, 2],
   		"ドイツ語圏文化入門" : [1, 2],
   		"フランス語入門Ⅰ" : [1, 2],
   		"フランス語入門Ⅱ" : [1, 2], 
   		"フランス語入門Ⅲ" : [1, 2],
   		"フランス語入門Ⅳ" : [1, 2], 
   		"フランス語会話入門Ⅰ" : [1, 2],
   		"フランス語会話入門Ⅱ" : [1, 2], 
   		"インテンシブフランス語Ⅰ" : [1, 4],
   		"インテンシブフランス語Ⅱ" : [1, 4],
   		"インテンシブフランス語Ⅲ" : [1, 2],
   		"インテンシブフランス語Ⅳ" : [1, 2],
   		"フランス語圏文化入門" : [1, 2],
   		"スペイン語入門Ⅰ" : [1, 2],
   		"スペイン語入門Ⅱ" : [1, 2],
   		"スペイン語入門Ⅲ" : [1, 2],
   		"スペイン語入門Ⅳ" : [1, 2], 
   		"スペイン語会話入門Ⅰ" : [1, 2],
   		"スペイン語会話入門Ⅱ" : [1, 2], 
		"インテンシプスペイン語Ⅰ" : [1, 4],
   		"インテンシプスペイン語Ⅱ" : [1, 4],
   		"インテンシブスペイン語Ⅲ" : [1, 2],
   		"インテンシブスペイン語Ⅳ" : [1, 2],
   		"スペイン語圏文化入門" : [1, 2],
   		"中国語基礎Ⅰ" : [1, 4],
   		"中国語基礎Ⅱ" : [1, 4],
   		"中国語中級" : [1, 4],
   		"中国語上級" : [1, 2],
   		"中国語会話" : [1, 2],
   		"中国語講読" : [1, 2],
   		"中国語演習" : [1, 2],
   		"時事中国語" : [1, 2],
   		"中国語作文" : [1, 2],
   		"実践中国語" : [1, 2],
   		"朝鮮語基礎Ⅰ" : [1, 4],
   		"朝鮮語基礎Ⅱ" : [1, 4],
   		"朝鮮語中級" : [1, 4],
   		"朝鮮語講読" : [1, 2],
  		 "朝鮮語演習" : [1, 2],
   		"タイ語基礎Ⅰ" : [1, 4],
   		"タイ語基礎Ⅱ" : [1, 4],
   		"ヴェトナム語基礎Ⅰ" : [1, 4],
   		"ヴェトナム語基礎Ⅱ" : [1, 4],
   		"ヴェトナム語中級" : [1, 4],
   		"ラテン語入門Ⅰ" : [1, 2],
   		"ラテン語入門Ⅱ" : [1, 2],
   		"ロシア語入門Ⅰ" : [1, 2],
   		"ロシア語入門Ⅱ" : [1, 2],
	]
	return lists
    }

}
