
class MajorClassLists{

    func getAdvancedComputerScienceDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"デジタル回路":[17,2],
            	"情報ネットワーク２":[17,2],
            	"VLSI設計":[17,2],
            	"言語理論とオートマトン":[17,2],
            	"ディジタル信号処理":[17,2],
            	"情報理論":[17,2],
            	"ソフトウェア工学":[17,2],
            	"数理計画とアルゴリズム":[17,2],
            	"並列分散処理":[17,2],
            	"ヒューマンコンピュータインタラクション":[17,2],
            	"ソフトウェア開発演習２":[17,2],
            	"ソフトウェア開発演習３":[17,2],
            	"計算機言語構成論":[17,2],
            	"ディジタル制御論":[17,2],
            	"画像処理":[17,2],
            	"ネットワークセキュリティ":[17,2],
            	"ディジタルシステム設計":[17,2],
           	"インターネットアーキテクチャ":[17,2],
           	"機械学習":[17,2],
            	"知能ロボット":[17,2],
            	"コレクティブインテリジェンス":[17,2],
            	"データマイニング":[17,2],
	]
	return lists	
    }

    func getInfomationTechnologyDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
   		"プログラミング演習I" :[11:2],
    		"プログラミング演習Ⅱ":[11,2]
	]
	return lists
    }

    func getIntelligentInfomationCore() -> Dictionary<String,Array<Int>>{

	let lists = [
		"プログラミングI":[15,2],
    		"プログラミングⅡ":[15,2],
    		"技術者の倫理":[15:2],
   		"アルゴリズムとデータ構造":[15,2],
   		"データサイエンス基礎":[15,4],
    		"コンピュータシステム":[15,2],
    		"情報ネットワークI":[15,2],
    		"ソフトウェア開発演習I":[15,2],
    		"コンピュータアーキテクチャ":[15,2],
    		"オペレーティングシステム":[15,2],
    		"データベースシステム":[15,2],
    		"人工知能":[15,2]
	]
	return lists
    }

    func getOptionalEngineeringDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"材料生産工学概論":[16,2],
		"熱流体工学概論":[16,2],
		"エネルギー変換工学基礎":[16,2],
		"環境工学概論":[16,2],
		"電気電子工学基礎":[16,2],
		"メカトロニクス":[16,2],
		"通信工学概論":[16,2],
		"都市地域計画":[16,2],
		"道路交通計画":[16,2],
		"橋設計論":[16,2],
		"海底資源工学":[16,2],
		"地震工学":[16,2],
		"島嶼環境計画論":[16,2],
		"基礎流体力学":[16,2],
		"住居建築概論":[16,2],
		"機器構造学":[16,2],
		"亜熱帯資源材料学":[16,2],
		"流体力学":[16,2],
		"熱機関工学":[16,2],
		"エネルギー移動工学":[16,2],
		"腐食防食工学":[16,2],
		"パワーエレクトロニクス":[16,2],
		"制御工学":[16,2],
		"電気電子計測工学１":[16,2],
		"電子デバイス工学":[16,2],
		"プロジェクト・マネジメント":[16,2],
		"維持管理工学":[16,2],
		"腐食防食と疲労":[16,2],
		"減災計画":[16,2],
		"環境衛生工学":[16,2],
		"火薬学":[16,2],
		"建築意匠":[16,2],
		"都市デザイン演習":[16,2],
		"耐震設計概論":[16,2],
		"都市および地方計画":[16,2],
		"公共計画の技術と理論":[16,2],
	]
	return lists
    }

    func getOptionalBasicMathDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
		"確率および統計":[17,2],
		"工業数学3":[17,2],
		"工業数学４":[17,2],
	]
	return lists
    }

    func getRequiredBasicMathDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
    		"工業数学Ⅰ":[14,2],
    		"工業数学Ⅱ":[14,2],
    		"離散数学":[14,2]
	]
	return lists
    }

    func getReserchExperienceDictionary() -> Dictionary<String,Array<Int>>{

	let lists = [
    		"知能情報実験I":[13,1.5],
    		"知能情報実験Ⅱ":[13,1.5],
    		"知能情報実験Ⅲ":[13,2],
    		"エンジニアリングデザイン演習":[13,2],
    		"卒業研究I":[13,2],
    		"卒業研究Ⅱ":[13,2],
    		"セミナーI":[13,1],
    		"セミナーⅡ":[13,1]
	]
	return lists
    }

}