//
//  File.swift
//  kazuaki
//
//  Created by 山城怜以 on 2019/11/23.
//  Copyright © 2019 山城怜以. All rights reserved.
//

import Foundation
let AdvancedComputerScienceDictionary=[
    "デジタル回路":[17,2],
    "情報ネットワーク２":[17,2],
    "VLSI設計":[17,2],
    "言語理論とオートマトン":[17,2],
    "ディジタル信号処理":[17,2],
    "情報理論":[17,2],
    "ソフトウェア工学":[17,2],
    "数理計画とアルゴリズム":[17,2],
    "並列分散処理":[17,2],
    "ヒューマンコンピュータインタラクション":[17,2],
    "ソフトウェア開発演習２":[17,2],
    "ソフトウェア開発演習３":[17,2],
    "計算機言語構成論":[17,2],
    "ディジタル制御論":[17,2],
    "画像処理":[17,2],
    "ネットワークセキュリティ":[17,2],
    "ディジタルシステム設計":[17,2],
    "インターネットアーキテクチャ":[17,2],
    "機械学習":[17,2],
    "知能ロボット":[17,2],
    "コレクティブインテリジェンス":[17,2],
    "データマイニング":[17,2],
]
