
class CommonClassLists{

    func getCareerDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"キャリア形成入門":[6,2.0],
		"キャリアデザインとジェンダーⅠ":[6,2.0],
		"キャリアデザインとジェンダーⅡ":[6,2.0],
		"海外キャリア形成入門":[6,2.0],
		"海外職場体験":[6,2.0],
		"生命保険実務":[6,2.0],
		"損害保険実務":[6,2.0],
		"地域企業(自治体)お題解決プログラム":[6,2.0],
		"日本企業インターシップⅠ":[6,2.0],
		"日本企業インターシップⅡ":[6,2.0],
		"キャリア関係特別講義Ⅰ(有償型職場実践プログラム)":[6,2.0],
		"キャリア関係特別講義Ⅱ(中期インターシップ)":[6,2.0],
		"キャリア関係特別講義Ⅴ (人生100年時代におけるキャリア開発のための働き方入門)":[6,2.0],
		"キャリア関係特別講義Ⅲ(石垣ウェルネス地方創生インターシップ)":[6,2.0],
		"キャリ関係特別講義Ⅳ(カトープレジャーグループKPG HOTEL & RESORT)":[6,2.0],
	]
	return lists
    }

    func getHumanitiesDictionary() -> Dictionary<String,Array<Double>>{

        let  lists = [
		"人間と哲学の知":[0,2.0],
		"心の科学":[0,2.0],
		"人間関係論":[0,2.0],
		"人間観と教育":[0,2.0],
		"日本古典文学の世界":[0,2.0],
		"文学の楽しみ":[0,2.0],
		"中国古典文学の世界":[0,2.0],
		"西洋の歴史と文化":[0,2.0],
		"考古学入門":[0,2.0],
		"コーラスアンサンブルの楽しみ":[0,2.0],
		"楽しく学ぶギター弾き語りⅠ":[0,2.0],
		"ステージスタッフ総額活動":[0,2.0],
		"美術って何？":[0,2.0],
		"陶芸の世界":[0,2.0],
		"比較思想文化論":[0,2.0],
		"日本語研究入門":[0,2.0],
		"オーケストラの楽しみⅠ":[0,2.0],
		"思考の論理入門":[0,2.0],
		"人間と宗教":[0,2.0],
		"西洋思想と日本・中国の思想":[0,2.0],
		"近代日本の社会と表現":[0,2.0],
		"小説の社会学":[0,2.0],
		"ことばの生態":[0,2.0],
		"ことばの構造と意味":[0,2.0],
		"日本語のはたらき":[0,2.0],
		"20世紀の中国文学":[0,2.0],
		"宗教と世界":[0,2.0],
		"美術の世界":[0,2.0],
		"楽しく学ぶギター弾き語りⅡ":[0,2.0],
		"美術と社会":[0,2.0],
		"オーケストラの楽しみⅡ":[0,2.0],
	]
	return lists
    }

    func getRelatedInformationDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"情報科学演習":[9,2.0],
		"日本語表現法入門":[9,2.0],
	]
	return lists
    }

    

    func getSportsDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"健康・スポーツ科学":[4,2.0],
		"健康・スポーツ科学演習(バドミントン)":[4,2.0],
		"健康・スポーツ科学演習(テニス)":[4,2.0],
		"健康・スポーツ科学演習(卓球)":[4,2.0],
		"健康・スポーツ科学演習(サッカー)":[4,2.0],
		"健康・スポーツ科学演習(フットサル)":[4,2.0],
		"健康・スポーツ科学演習(バスケットボール)":[4,2.0],
		"健康・スポーツ科学演習(空手)":[4,2.0],
		"健康・スポーツ科学演習(ニュースポーツ)":[4,2.0],
		"健康・スポーツ科学演習(アウトドアレクリェーション)":[4,2.0],
		"健康・スポーツ科学演習(フォーク・ソーシャルダンス)":[4,2.0],
		"健康・スポーツ科学演習(マラソン)":[4,2.0],
		"健康・スポーツ科学演習(インドア・スポーツ)":[4,2.0],
	]
	return lists
    }

    func getPreparatoryDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"線型代数学Ⅰ":[8,2.0],
		"線型代数学演習":[8,2.0],
		"統計学":[8,2.0],
		"統計学Ⅰ":[8,2.0],
		"地球科学Ⅰ":[8,2.0],
		"物理学実験":[8,2.0],
		"化学Ⅰ":[8,2.0],
		"化学入門Ⅰ":[8,2.0],
		"化学実験":[8,2.0],
		"生物学Ⅰ":[8,2.0],
		"生物学Ⅱ":[8,2.0],
		"生物学実験":[8,2.0],
        "微分積分学ST Ⅰ":[8,2.0],
        "微分積分学ST Ⅱ":[8,2.0],
        "物理学Ⅰ":[8,2.0],
        "物理学Ⅱ":[8,2.0],
        "微分積分学入門 Ⅰ":[8,2.0],
        "微分積分学入門 Ⅱ":[8,2.0],
        "物理学入門Ⅰ":[8,2.0],
        "物理学入門Ⅱ":[8,2.0],
	]
	return lists
    }

    func getRyukyuDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"平和論":[7,2.0],
		"核の科学":[7,2.0],
		"女性と社会":[7,2.0],
		"沖縄の基地と戦跡I":[7,2.0],
		"近代沖縄の社会と実現":[7,2.0],
		"琉球の文学":[7,2.0],
		"地域の科学":[7,2.0],
		"琉球の自然":[7,2.0],
		"琉球の自然保護":[7,2.0],
		"沖縄のサンゴ礁":[7,2.0],
		"琉球弧の自然誌":[7,2.0],
		"琉球の地理":[7,2.0],
		"現代の国際関係":[7,2.0],
		"琉球アジア研究入門":[7,2.0],
		"移民論":[7,2.0],
		"沖縄の政治と社会":[7,2.0],
		"うちなーぐちあしび":[7,2.0],
		"沖縄の学力と教育":[7,2.0],
		"琉球語入門Ⅰ":[7,2.0],
		"琉球語入門Ⅱ":[7,2.0],
		"沖縄の染めと織り":[7,2.0],
		"沖縄の歴史入門":[7,2.0],
		"琉球学入門":[7,2.0],
		"琉球の自然と人":[7,2.0],
		"現代沖縄地域論":[7,2.0],
		"現代沖縄の地域復興":[7,2.0],
		"地域システム計画論":[7,2.0],
		"地域環境と生活空間":[7,2.0],
		"地域プロジェクト実践":[7,2.0],
		"地域フィールドワーク入門":[7,2.0],
		"島嶼地域科学入門":[7,2.0],
		"沖縄の航空事業と地域振興":[7,2.0],
		"グローカル実践演習I":[7,2.0],
		"グローカル実践演習Ⅱ":[7,2.0],
	]
	return lists
    }

    func getNatureDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"大気の科学":[2.0,2.0],
		"地球の科学":[2.0,2.0],
		"海洋の科学":[2.0,2.0],
		"宇宙の科学":[2.0,2.0],
		"科学の光と影":[2.0,2.0],
		"統計と社会":[2.0,2.0],
		"数理の構造":[2.0,2.0],
		"数の文化":[2.0,2.0],
		"時間と空間":[2.0,2.0],
		"人間と物理学":[2.0,2.0],
		"生活の化学":[2.0,2.0],
		"分子の世界":[2.0,2.0],
		"生物の生活":[2.0,2.0],
		"生命の科学":[2.0,2.0],
		"パースの世界":[2.0,2.0],
		"沖縄の風景":[2.0,2.0],
		"社会統計学基礎":[2.0,2.0],
		"都市環境と計画":[2.0,2.0],
		"ランドスケープ論":[2.0,2.0],
		"環境デザイン論":[2.0,2.0],
		"地球環境と科学技術":[2.0,2.0],
		"自然環境と土木工学":[2.0,2.0],
		"生物資源利用とサイエンス":[2.0,2.0],
		"食料・農村・環境概論":[2.0,2.0],
		"ヒトの健康科学":[2.0,2.0],
		"人の健康科学":[2.0,2.0],
	]
	return lists
    }

    func getSocietyDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"法と社会":[3,2.0],
		"憲法概論":[3,2.0],
		"現代政治の課題":[3,2.0],
		"日本の政治":[3,2.0],
		"マスコミと社会":[3,2.0],
		"戦争と平和の諸問題":[3,2.0],
		"地域と生活":[3,2.0],
		"現代社会のしくみ":[3,2.0],
		"人類文化の比較":[3,2.0],
		"経済の歴史":[3,2.0],
		"現代経済のしくみ":[3,2.0],
		"現代経営のしくみ":[3,2.0],
		"情報メディアと創造性":[3,2.0],
		"大学教育論":[3,2.0],
		"教育政策史":[3,2.0],
		"ベンチャー企業入門":[3,2.0],
		"ベンチャー起業実践":[3,2.0],
		"社会系特別講義Ⅰ(社会調査入門)":[3,2.0],
		"ジェンダー学とインターセクショナリティ":[3,2.0],
	]
	return lists
    }

   func getSyntheticDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"脳の発達と人間":[5,2.0],
		"アメリカの文化と社会":[5,2.0],
		"住まいの科学":[5,2.0],
		"情報科学概論":[5,2.0],
		"動物実験の基礎":[5,2.0],
		"人口と食糧":[5,2.0],
		"災害と安全":[5,2.0],
		"環境と文学":[5,2.0],
		"グローバル実践演習Ⅰ":[5,2.0],
		"グローバル実践演習Ⅱ":[5,2.0],
		"情報セキュリティ概論":[5,2.0],
		"環境影響評価概論":[5,2.0],
		"論理総合討論":[5,2.0],
		"総合環境論":[5,2.0],
		"適応の心理":[5,2.0],
		"日本語学概説Ⅱ":[5,2.0],
		"日本語教育学概説Ⅱ":[5,2.0],
		"日本語教育各論Ⅱ":[5,2.0],
		"日本語教材研究Ⅱ":[5,2.0],
		"日本語教授法Ⅱ":[5,2.0],
		"日本語教育実習":[5,2.0],
		"日本語教育演習Ⅱ":[5,2.0],
		"日本語教育演習Ⅳ":[5,2.0],
	]
	return lists
    }

   func getOtherLanguageDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
   		"大学英語" : [1.0, 4],
   		"英語講読演習 中級" : [1.0, 2.0],
   		"英語講読演習 上級" : [1.0, 2.0],
           "英会話演習 中級" : [1.0, 2.0],
   		"英会話演習 上級" : [1.0, 2.0],
           "英作文演習 中級" : [1.0, 2.0],
   		"英作文演習 上級" : [1.0, 2.0],
           "英語プレゼンテーション演習 中級" : [1.0, 2.0],
   		"英語プレゼンテーション演習 上級" : [1.0, 2.0],
   		"TOEIC演習" : [1.0, 2.0],
   		"TOEFL演習" : [1.0, 2.0],
   		"英検準1級演習" : [1.0, 2.0],
   		"特定英語課題演習Ⅰ" : [1.0, 2.0],
   		"特定英語課題演習Ⅱ" : [1.0, 2.0],
   		"ドイツ語入門Ⅰ" : [1.0, 2.0],
   		"ドイツ語入門Ⅱ" : [1.0, 2.0],
   		"ドイツ語入門Ⅲ" : [1.0, 2.0],
   		"ドイツ語入門Ⅳ" : [1.0, 2.0],
   		"ドイツ語会話入門Ⅰ" : [1.0, 2.0],
   		"ドイツ語会話入門Ⅱ" : [1.0, 2.0],
   		"インテンシブドイツ語Ⅰ" : [1.0, 4],
   		"インテンシブドイツ語Ⅱ" : [1.0, 4],
   		"インテンシブドイツ語Ⅲ" : [1.0, 2.0],
   		"インテンシブドイツ語Ⅳ" : [1.0, 2.0],
   		"ドイツ語圏文化入門" : [1.0, 2.0],
   		"フランス語入門Ⅰ" : [1.0, 2.0],
   		"フランス語入門Ⅱ" : [1.0, 2.0],
   		"フランス語入門Ⅲ" : [1.0, 2.0],
   		"フランス語入門Ⅳ" : [1.0, 2.0],
   		"フランス語会話入門Ⅰ" : [1.0, 2.0],
   		"フランス語会話入門Ⅱ" : [1.0, 2.0],
   		"インテンシブフランス語Ⅰ" : [1.0, 4],
   		"インテンシブフランス語Ⅱ" : [1.0, 4],
   		"インテンシブフランス語Ⅲ" : [1.0, 2.0],
   		"インテンシブフランス語Ⅳ" : [1.0, 2.0],
   		"フランス語圏文化入門" : [1.0, 2.0],
   		"スペイン語入門Ⅰ" : [1.0, 2.0],
   		"スペイン語入門Ⅱ" : [1.0, 2.0],
   		"スペイン語入門Ⅲ" : [1.0, 2.0],
   		"スペイン語入門Ⅳ" : [1.0, 2.0],
   		"スペイン語会話入門Ⅰ" : [1.0, 2.0],
   		"スペイン語会話入門Ⅱ" : [1.0, 2.0],
		"インテンシプスペイン語Ⅰ" : [1.0, 4],
   		"インテンシプスペイン語Ⅱ" : [1.0, 4],
   		"インテンシブスペイン語Ⅲ" : [1.0, 2.0],
   		"インテンシブスペイン語Ⅳ" : [1.0, 2.0],
   		"スペイン語圏文化入門" : [1.0, 2.0],
   		"中国語基礎Ⅰ" : [1.0, 4],
   		"中国語基礎Ⅱ" : [1.0, 4],
   		"中国語中級" : [1.0, 4],
   		"中国語上級" : [1.0, 2.0],
   		"中国語会話" : [1.0, 2.0],
   		"中国語講読" : [1.0, 2.0],
   		"中国語演習" : [1.0, 2.0],
   		"時事中国語" : [1.0, 2.0],
   		"中国語作文" : [1.0, 2.0],
   		"実践中国語" : [1.0, 2.0],
   		"朝鮮語基礎Ⅰ" : [1.0, 4],
   		"朝鮮語基礎Ⅱ" : [1.0, 4],
   		"朝鮮語中級" : [1.0, 4],
   		"朝鮮語講読" : [1.0, 2.0],
  		 "朝鮮語演習" : [1.0, 2.0],
   		"タイ語基礎Ⅰ" : [1.0, 4],
   		"タイ語基礎Ⅱ" : [1.0, 4],
   		"ヴェトナム語基礎Ⅰ" : [1.0, 4],
   		"ヴェトナム語基礎Ⅱ" : [1.0, 4],
   		"ヴェトナム語中級" : [1.0, 4],
   		"ラテン語入門Ⅰ" : [1.0, 2.0],
   		"ラテン語入門Ⅱ" : [1.0, 2.0],
   		"ロシア語入門Ⅰ" : [1.0, 2.0],
   		"ロシア語入門Ⅱ" : [1.0, 2.0],
	]
	return lists
    }
    
    func getIntensivelectureDictionary() -> Dictionary<String,Array<Double>>{
        
        let lists = [
            "外国語-集中講義1単位物":[1,1.0],
            "外国語-集中講義2単位物":[1,2.0],
            "外国語-集中講義4単位物":[1,4.0],
            "自然-集中講義1単位物":[2,1.0],
            "自然-集中講義2単位物":[2,2.0],
            "自然-集中講義4単位物":[2,4.0],
            "社会-集中講義1単位物":[3,1.0],
            "社会-集中講義2単位物":[3,2.0],
            "社会-集中講義4単位物":[3,4.0],
            "健康運動-集中講義1単位物":[4,1.0],
            "健康運動-集中講義2単位物":[4,2.0],
            "健康運動-集中講義4単位物":[4,4.0],
            "総合-集中講義1単位物":[5,1.0],
            "総合-集中講義2単位物":[5,2.0],
            "総合-集中講義4単位物":[5,4.0],
            "キャリア-集中講義1単位物":[6,1.0],
            "キャリア-集中講義2単位物":[6,2.0],
            "キャリア-集中講義4単位物":[6,4.0],
            "琉球-集中講義1単位物":[7,1.0],
            "琉球-集中講義2単位物":[7,2.0],
            "琉球-集中講義4単位物":[7,4.0],
            "専修-集中講義1単位物":[8,1.0],
            "専修-集中講義2単位物":[8,2.0],
            "専修-集中講義4単位物":[8,4.0],
            "情報関連-集中講義1単位物":[9,1.0],
            "情報関連-集中講義2単位物":[9,2.0],
            "情報関連-集中講義4単位物":[9,4.0],
            "知能情報関連-集中講義1単位物":[17,1.0],
            "知能情報関連-集中講義2単位物":[17,2.0],
            "知能情報関連-集中講義4単位物":[17,4.0],
        ]
        return lists
    }
}
