
class MajorClassLists{
    func getGeneralExerciseDictionaly() -> Dictionary<String,Array<Double>>{
        
        let lists = [
            "工学基礎演習":[12,2.0],
            "キャリアデザイン入門":[12,1.0],
            "プロジェクトデザイン":[12,2.0],
            "キャリアデザイン":[12,2.0]
        ]
        return lists
    }
    func getAdvancedComputerScienceDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"デジタル回路":[17,2.0],
            	"情報ネットワーク２":[17,2.0],
            	"VLSI設計":[17,2.0],
            	"言語理論とオートマトン":[17,2.0],
            	"ディジタル信号処理":[17,2.0],
            	"情報理論":[17,2.0],
            	"ソフトウェア工学":[17,2.0],
            	"数理計画とアルゴリズム":[17,2.0],
            	"並列分散処理":[17,2.0],
            	"ヒューマンコンピュータインタラクション":[17,2.0],
            	"ソフトウェア開発演習２":[17,2.0],
            	"ソフトウェア開発演習３":[17,2.0],
            	"計算機言語構成論":[17,2.0],
            	"ディジタル制御論":[17,2.0],
            	"画像処理":[17,2.0],
            	"ネットワークセキュリティ":[17,2.0],
            	"ディジタルシステム設計":[17,2.0],
           	"インターネットアーキテクチャ":[17,2.0],
           	"機械学習":[17,2.0],
            	"知能ロボット":[17,2.0],
            	"コレクティブインテリジェンス":[17,2.0],
            	"データマイニング":[17,2.0],
	]
	return lists	
    }

    func getInfomationTechnologyDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
   		"プログラミング演習I" :[11,2.0],
        "プログラミング演習Ⅱ":[11,2.0]
        ]
        return lists
    }

    func getIntelligentInfomationCore() -> Dictionary<String,Array<Double>>{

	let lists = [
		"プログラミングI":[15,2.0],
    		"プログラミングⅡ":[15,2.0],
    		"技術者の倫理":[15,2.0],
   		"アルゴリズムとデータ構造":[15,2.0],
   		"データサイエンス基礎":[15,4],
    		"コンピュータシステム":[15,2.0],
    		"情報ネットワークI":[15,2.0],
    		"ソフトウェア開発演習I":[15,2.0],
    		"コンピュータアーキテクチャ":[15,2.0],
    		"オペレーティングシステム":[15,2.0],
    		"データベースシステム":[15,2.0],
    		"人工知能":[15,2.0]
        ]
        return lists
    }

    func getOptionalEngineeringDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"材料生産工学概論":[16,2.0],
		"熱流体工学概論":[16,2.0],
		"エネルギー変換工学基礎":[16,2.0],
		"環境工学概論":[16,2.0],
		"電気電子工学基礎":[16,2.0],
		"メカトロニクス":[16,2.0],
		"通信工学概論":[16,2.0],
		"都市地域計画":[16,2.0],
		"道路交通計画":[16,2.0],
		"橋設計論":[16,2.0],
		"海底資源工学":[16,2.0],
		"地震工学":[16,2.0],
		"島嶼環境計画論":[16,2.0],
		"基礎流体力学":[16,2.0],
		"住居建築概論":[16,2.0],
		"機器構造学":[16,2.0],
		"亜熱帯資源材料学":[16,2.0],
		"流体力学":[16,2.0],
		"熱機関工学":[16,2.0],
		"エネルギー移動工学":[16,2.0],
		"腐食防食工学":[16,2.0],
		"パワーエレクトロニクス":[16,2.0],
		"制御工学":[16,2.0],
		"電気電子計測工学１":[16,2.0],
		"電子デバイス工学":[16,2.0],
		"プロジェクト・マネジメント":[16,2.0],
		"維持管理工学":[16,2.0],
		"腐食防食と疲労":[16,2.0],
		"減災計画":[16,2.0],
		"環境衛生工学":[16,2.0],
		"火薬学":[16,2.0],
		"建築意匠":[16,2.0],
		"都市デザイン演習":[16,2.0],
		"耐震設計概論":[16,2.0],
		"都市および地方計画":[16,2.0],
		"公共計画の技術と理論":[16,2.0],
	]
	return lists
    }

    func getOptionalBasicMathDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
		"確率および統計":[17,2.0],
		"工業数学Ⅲ":[17,2.0],
		"工業数学Ⅳ":[17,2.0],
	]
	return lists
    }

    func getRequiredBasicMathDictionary() -> Dictionary<String,Array<Double>>{

	let lists = [
    		"工業数学Ⅰ":[14,2.0],
    		"工業数学Ⅱ":[14,2.0],
    		"離散数学":[14,2.0]
	]
	return lists
    }
    func getRelationalComputerScienceDictionary() -> Dictionary<String,Array<Double>>{
        
        let lists = [
            "基礎数学１":[17,1.0],
            "基礎数学２":[17,1.0],
            "情報処理技術概要":[17,2.0],
            "インターンシップ１":[17,1.0],
            "インターンシップ２":[17,1.0],
            "インターンシップ３":[17,2.0],
            "技術英語１":[17,2.0],
            "技術英語２":[17,2.0],
            "技術英語３":[17,2.0],
            "産業社会学言論１":[17,2.0],
            "産業社会学言論２":[17,2.0],
            "地域創生論":[17,2.0],
            "国際協力論":[17,2.0],
            "情報技術演習１":[17,2.0],
            "情報技術演習２":[17,2.0],
            "情報技術演習３":[17,1.0],
            "情報技術演習４":[17,1.0],
            "知能情報特別講義１":[17,2.0],
            "知能情報特別講義２":[17,2.0],
            "知能情報特別講義３":[17,1.0],
            "知能情報特別講義４":[17,1.0],
            "国際インターンシップ１":[17,1.0],
            "国際インターンシップ２":[17,2.0],
            "Frontiers of Engineering":[17,2.0],
            "知的財産権":[17,2.0],
            "品質管理":[17,2.0],
            "経営工学概論":[17,2.0],
            "ICT実践英語１":[17,2.0],
            "ICT実践英語２":[17,2.0],
            "情報化教育法A":[17,2.0],
            "情報化教育法B":[17,2.0],
            "職業指導(工学)":[17,2.0],
            "教職総合演習(情報)":[17,2.0],
            "教職実践演習(高)":[17,2.0],
        ]
        return lists
    }
    
    func getResearchExperienceDictionary() -> Dictionary<String,Array<Double>>{
        let lists = [
        "知能情報実験I":[13,1.5],
        "知能情報実験Ⅱ":[13,1.5],
        "知能情報実験Ⅲ":[13,2.0],
        "エンジニアリングデザイン演習":[13,2.0],
        "卒業研究I":[13,2.0],
        "卒業研究Ⅱ":[13,2.0],
        "セミナーI":[13,1.0],
        "セミナーⅡ":[13,1.0]
    ]
        return lists
    }
}
